{
    "set": [
        {
            "id": "LEA",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "LEB",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "2ED",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "3ED",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "4ED",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "5ED",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "6ED",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "7ED",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "8ED",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "9ED",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "10E",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "M10",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "M11",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "M12",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "M13",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "M14",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "M15",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "ORI",
            "story": "The set tells the origin stories of several planeswalkers - Gideon Jura, Jace Beleren, Chandra Nalaar, Liliana Vess and Nissa Revane - who are going to be playing a big role in up-coming story arcs. We see these characters' home worlds, learn about the joys and crises of their early lives, and discover how they became the multiverse-traveling planeswalkers we know today.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "ARN",
            "story": "As a result of the real-world references and stark difference from the world of Dominaria, Arabian Nights was to take place in the plane of Rabiah, which once had been ruled by the Djinni. After the Djinni had weakened themselves in the Spirit War known as The Jihad, humans became the main race of Rabiah. Characters like Aladdin, Ali Baba and King Suleiman had lived long ago. After that the plane was reproduced a thousand times in the Thousand-fold Refraction of Rabiah to keep the 1001 Nights parallel going.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "ATQ",
            "story": "Ancient artifacts of the Thran Empire are discovered on the continent of Terisiare, including many advanced machines of war. Two brothers, Urza and Mishra, discover a stone in the Caves of Koilos; but, when they disturb it, it splits in two—Mightstone and Weakstone—unleashing the evil of Phyrexia on Dominaria. The ancient machines of the Thran are employed in battle once again as the Brothers' War takes place, an epic war between Urza and Mishra for control of both halves of the stone. The war culminates in the Sylex Blast, plunging the world into the Ice Age.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "LEG",
            "story": " ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "DRK",
            "story": "The climax of the Brothers' War was the Sylex Blast, which lofted debris into the air blotting out the sun and creating The Dark. Without the sun the climate begins to cool, and an anti-magic religion comes to power, blaming the Sylex blast and its effects on all magic and its users. Persecution of these magic using wizards led to the creation of the fabled City of Shadows in the east and the Conclave of Mages in the west, where they hid themselves during this time.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "FEM",
            "story": "After the Brothers' War, on the Dominarian continent of Sarpadia, the Ice Age is approaching. The changing climate results in dwindling resources and fighting amongst allies for survival.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "ICE",
            "story": "The Ice Age storyline, like the earlier sets that took place on Dominaria, occurred on the continent of Terisiare, where the Brothers' War had taken place. That war ended with the Sylex Blast, which was powerful enough to alter the planet's climate. All the major civilizations of Terisiare had been destroyed by either the war or the ice. New cultures arose on the ice, fighting bitterly for survival, but when the necromancer Lim-Dûl unleashed a horde of undead, old enemies were forced to work together or be overwhelmed.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "HML",
            "story": "The planeswalker Feroz came across Ulgrotha, the once-beautiful plane now destroyed by the Wizards' Wars. At the last unspoilt oasis on this plane he met fellow planeswalker Serra, whom he married. Together they worked to restore the plane, and to protect it, Feroz's Ban was created. Later, Feroz died during a lab accident, and the grief-stricken Serra abandoned the plane. In her absence the isolated civilizations of the plane fight amongst each other while the vampire Baron Sengir plots to take control of the plane under the fading Ban of Feroz.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "ALL",
            "story": "After the planeswalker Freyalise cast her World Spell, thereby ending the Ice Age, a population long adapted to the cold had to re-adjust to warm weather. With the new climate came devastating floods and plagues, and the necromancer Lim-Dûl has built an army of undead bent on world domination. An alliance is formed between races to defeat Lim-Dûl and his army.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "MIR",
            "story": "Mirage stands apart from the rest of Magic for its tropical African-themed setting, outlining the three nations of Femeref, Zhalfir, and Suq'Ata. The storyline begins with the disappearance of the planeswalker Teferi (who would later play a crucial role in the Weatherlight Saga and the Time Spiral block) and the three powerful spellcasters — Mangara, Jolrael, and Kaervek — who come looking for him, setting off the events that would lead to the Mirage War.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "VIS",
            "story": "The story continues the struggle between the nations of Jamuraa against the evil Kaervek, only now Femeref has been destroyed and Suq'Ata and Zhalfir begin to have internal problems as well. There is hope, however, when Kaervek's ally Jolrael betrays him at the urging of the planeswalker Teferi. Jamuraa's leaders, led by Jolrael's visions, free Mangara from the Amber Prison and begin to fight against Kaervek.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "WTH",
            "story": "Four thousand years after Urza and Mishra reopened the portal to Phyrexia, the evil lord Yawgmoth sits poised to invade his one-time home - Dominaria. The plane's only hope for survival is a cache of powerful artifacts known collectively as the Legacy. When put together to assemble a powerful dooms-day weapon, these artifacts will have the potential to destroy the dark powers that will try to invade the planet. The focal point of this weapon is a flying ship called Weatherlight, and its intrepid crew searches the planes to find all of the pieces of the Legacy before the invasion commences. Only the reluctant leadership of Gerrard Capashen and the skills of Squee the cabin boy and Tahngarth the hulking minotaur will save the day. It doesn't help that captain Sisay has been kidnapped, and they have to travel to the plane of Rath to save her before they can complete their destiny.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "TMP",
            "story": "The set takes place on the stormy plane of Rath, where Gerrard and the heroes of the Skyship Weatherlight set out to find Volrath's stronghold.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "STH",
            "story": "Gerrard and the crew of the Weatherlight journey through the bowels of Volrath's Stronghold, battling the twisted creations of Volrath's evil mind in an attempt to rescue their imprisoned comrades. The stronghold yields many dark secrets about the crew's friends, enemies, and themselves.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "EXO",
            "story": "The crew of the Weatherlight has rescued the pieces of the Legacy and Captain Sisay, and now must retreat through Volrath's Stronghold and escape to the portal that would lead them off of Rath. Volrath and his main lieutenant Greven il-Vec will stop at nothing to destroy them and reclaim the ancient artifacts that will allow Volrath to oppose his hidden master. However, they must also stave off the combined assault of Volrath's Stronghold by the elves of the Skyshroud Forest and the human tribes of the Kor, Vec, and Dal, recently reunited by Gerrard. Also, a disturbing change has happened to Crovax, the noble who accompanied the Weatherlight to Rath. His newly-formed bloodlust and thirst for power threatens to destroy the entire ship. Meanwhile Ertai stands alone in a cruel landscape, focused on a singular task. He must open the arcane portal before his comrades return from the dark fortress... if they return.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "USG",
            "story": "From the perilous domains of Phyrexia and Shiv to the splendor of Serra's Realm, Argoth, and Tolaria, he travels the planes seeking weapons to destroy the dark forces that stalk him. New magic discovered. New power revealed. Urza's Saga has begun. Hundreds of years have passed since the Brothers' War, but many things that started there are only now coming to fruition. Urza's Saga departs from the story of Gerrard and Volrath in a flashback, showing the origins of the Legacy. The readers meet Teferi in his student days and Serra at the peak of her power.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "ULG",
            "story": "Urza continues to build a collection of artifacts and a skyship that will defeat the Phyrexian invasion. With the assistance of his student Jhoira and Karn, the silver golem, Urza surveys the Thran Mana Rig in Shiv and uncovers its primary purpose. While he is away, the people of his Tolarian Academy have to battle a Phyrexian infestation on the island itself. The story of this set is recounted in the book Time Streams.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "UDS",
            "story": "With the Weatherlight completed, Urza now works on a eugenics program to create a perfect crew for it, as well as engineering a race of soldiers to fight the Phyrexian invasion. One of his geneticists, Gatha, defects, and uses his knowledge to improve the Keldon race. Meanwhile, the Phyrexians create the plane of Rath as a staging ground for the invasion.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "MMQ",
            "story": "The Weatherlight's troubles continue as it crash-lands on a strange new plane. The ship is attacked by the Cho-Arrim, who steal the ship. Finally, soldiers from Mercadia City arrive to arrest the crew. Meanwhile, Orim, who was captured with the ship, learns more about her captors. The Cho-Arrim are spiritual people who suffer greatly under the greedy Mercadians. Their leader Cho-Manno explains that he took the Weatherlight's arrival as a sign prophesying the return of the sky god Ramos and the end of Mercadian rule. Orim slowly becomes sympathetic to the Cho-Arrim's situation and attracted to their leader. Mercadians are an evasive, aloof people: the nobles are hedonistic, apathetic, and lazy, while the commoners are selfish, grasping, and paranoid. Mercadian goblins are much larger and smarter than any the crew has encountered before, and they actually seem to be running the city despite their servile attitudes.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "NEM",
            "story": "The Phyrexian invasion of Dominaria is nearing; the Dark Lord's plans are almost complete. Only the Planeswalker Urza stands in his way. Rath's Evincar Volrath has abandoned his post, sparking a brutal contest among his would-be successors. Phyrexia has chosen Crovax to take Volrath's place, bestowing terrible new powers on the bloodthirsty noble. Crovax must still prove his worth, however, before he can claim the position. Meanwhile, Rath's rebels have united in the name of Eladamri, Lord of Leaves, in order to break free of Phyrexia's tyranny once and for all.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "PCY",
            "story": "Prophecy is set on the plane of Dominaria. Keld has declared war on Jamuraa. The city-states of Jamuraa form the Kipamu League and then repulse the invaders.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "INV",
            "story": "As the hordes of Phyrexia begin pouring into Dominaria, the world looks to Urza, planeswalker and master artificer, for defense against the onslaught. As entire cultures fall under the Phyrexian hell, Urza gathers heroes, renegades, common folk, and powerful artifacts to fight the invasion.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "PLS",
            "story": "The Phyrexian invasion is in full swing, and despite some early victories, Urza and the armies of Dominaria are losing. As the struggle rages, portions of the artificial plane Rath begin appearing in Dominaria, bringing hordes of Phyrexian reinforcements into the battle.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "APC",
            "story": "The Coalition forces hurled their might at the Stronghold, now overlaid onto the swamps of Urborg. Urza led a powerful group of planeswalkers to Phyrexia itself, hoping to destroy the invaders in their home. Gerrard and Urza are forced to fight each other in an arena, and when one kills the other, the loser is returned to life by Yawgmoth's power and the two must fight again. Eventually, Urza is decapitated and Gerrard escapes with the head, only to find himself in the Stronghold throne room, with a crazed Crovax standing over the broken form of Squee. Sisay, Karn, Tahngarth and the rest of the Weatherlight crew desperately search the Thran Tome, attempting to figure out how the Legacy and the Weatherlight are supposed to save Dominaria. The remaining coalition forces, lead by Grizzlegom, Eladamri and Lin Sivvi fight their way to the Stronghold, where they battle Crovax's Phyrexian soldiers.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "ODY",
            "story": "Odyssey is set on the continent of Otaria on the devastated plane of Dominaria, approximately a century after the events of the preceding set, Apocalypse of the Invasion block. The Odyssey block storyline features desert nomads and bird (aven) warriors of the Order; the highly advanced underwater Mer Empire of the cephalids; barbarian and dwarves of the Pardic Mountains; and the centaurs, druids, and other creatures of the Krosan Forest. Each of these civilizations struggle to survive day by day, a fact off which the Cabal, an occult and sinister organization, led by the Cabal Patriarch and includes members such as Braids and Chainer, that controls most of the land and its wealth, benefits, as it operates pit fights for entertainment of the masses and, for the one lucky pit warrior who survives, fame and fortune.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "TOR",
            "story": "Chainer's Torment presents the tale of Chainer, a Cabal dementia summoner, discovering the Mirari and rising through the ranks of the Cabal, rivaling the Cabal Patriarch himself, and his subsequential fall. Meanwhile Kamahl befriends Chainer, with whom he trains as a pit fighter and fights as an ally within the pits, and Laquatus plots to gain control of the Mer Empire for himself.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "JUD",
            "story": "Judgment follows the story of Kamahl, who, in keeping truth to his promise made to a dying Chainer, keeps the Mirari safe from others and from himself. Several characters, including Laquatus and Eesha, attempt to obtain the potent orb for themselves,; and, Kamahl's sister and mentor, Jeska and Balthor, endeavor to separate the Mirari from Kamahl, for fear of the corrupting influence that the orb has on Kamahl. Ultimately, after substantial politics and warring, the influence of the Mirari on individuals is diminished, as a majority of the characters are killed, and the Mirari, attached to Kamahl's sword, is implanted through the corpse of Laquatus and into the Krosan Forest, thereby channeling the powerful magic into the land and allowing both the fauna and flora to grow larger and wilder.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "ONS",
            "story": "A continuation of the storyline developed in the Odyssey Cycle, Onslaught and the Onslaught Cycle are set on the continent of Otaria on the devastated plane of Dominaria, approximately a century after the events of Apocalypse of the Invasion block. Kamahl has relocated to the Krosan Forest with the Mirari and becomes a druid of Krosa. The power of the Mirari begins to work on the forest, mutating its residents and growing some of them to gigantic proportions. Meanwhile, Kamahl's sister Jeska is transformed by foul Cabal healing magic, into Phage, a pit fighter whose touch brings death. The illusionist Ixidor discovers his new powers of reality sculpting. Ixidor uses his new power to create the angel Akroma.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "LGN",
            "story": "Kamahl and the Cabal, in an uneasy alliance, set out to defeat Akroma. Ixidor has been killed but Akroma nevertheless remains intent on destroying Phage. In the meantime, the slivers, last seen in the Weatherlight Saga, have been reintroduced as clones of the original slivers as part of the Riptide Project. In the conclusion of the novel and in a final battle between Phage and Akroma, the two beings and Zagorka merge to form Karona.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "SCG",
            "story": "With the vicious war between Phage and Akroma, and their followers, over with their deaths and fusion into Karona, an incredibly destructive and powerful avatar formed from all five colors of mana, Otaria is, once again, torn by various militant factions, all keen to claim Karona for themselves. In addition to this, the continent that was spared from a majority of the devastation occurring elsewhere on the plane of Dominaria during the events of Apocalypse, remains poisoned by the profuse perfusion of mana from the Mirari, with warping effects upon the populace; the weapons and armor of soldiers are merging with the soldiers themselves to produce virtually featureless, greatly muscle-bound living juggernauts; wizards becoming insubstantial and tenuous, as though they consisted of water or energy; elves, becoming taller, stronger, and wilder, begin to resemble the trees amongst which they live and that they protect.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "MRD",
            "story": "The setting for Mirrodin is a plane by the same name, an artificial world created by the planeswalker Karn, and named after the Mirari by Memnarch. Mirrodin's environments and inhabitants mix organic and metallic. Mirrodin is orbited by four satellites, which are called suns and moons interchangeably, that correspond to red, black, white and blue magic. Green was notably absent. Glissa Sunseeker, the finest hunter and perhaps the most skilled warrior of the elves, begins her story to find out why the monstrous \"levelers\" seek to destroy her. It is this search for answers that will begin to uncover the mysteries within Mirrodin.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "DST",
            "story": "\"The world . . . is . . . hollow.\" This is the secret that Chunth, the Tel-Jilad troll elder, entrusts to Glissa Sunseeker before his death at the hands of a traitor. Armed with that knowledge, Glissa fights her way through the great vedalken capital of Lumengrid, down into the Pool of Knowledge. The Synod's sacred chamber contains a lacuna -- a tunnel, saturated with blue mana -- that leads to Mirrodin's secret interior. There, huge, bizarre towers of fungus-like metal called mycosynth reach up toward an immense inner sun of pure mana. As Glissa flees from her vedalken pursuers, she discovers another secret inside this plane. Memnarch is real, and he patiently waits for the elvish champion to find him. In the meantime, he studies the blinkmoths and has begun to build a monument to his greatness as an artificer: the Darksteel Eye, a device that will make his omniscience over Mirrodin complete.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "5DN",
            "story": "Glissa, Bosh and Slobad journey deep within Mirrodin's core to confront the insidious Memnarch. With them is the Kaldra avatar -- an immensely powerful being of energy summoned when Kaldra's sword, shield, and helm were brought together. But what was supposed to be the world's salvation turns out to be a vile trick. With a single spell, Memnarch seizes the avatar and turns it on Glissa and her companions. Kaldra's avatar relentlessly pursues Glissa into the Tangle, destroying everything in its way. Finally, at the Radix, Glissa's destiny becomes clear. As rage and despair overcome her, Glissa's body calls forth a great column of green mana from Mirrodin's core, annihilating the avatar in the process. Now that mana hangs overhead in a glowing sphere --the green sun at last, Mirrodin's fifth dawn.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "CHK",
            "story": "The plane of Kamigawa is threatened as the spirits that are the essence of everything on it suddenly and inexplicably begin to wage war with its mortal inhabitants. Michiko, daughter of the warlord Konda, abandons the shrinking safety of her father's fortress to consult holy monks and the orochi, trying to decipher the cause of the Kamis' rage. Yet when Michiko meets Tetsuo Umezawa, a thief and black magic user, she realizes that to avert the complete destruction of Kamigawa, she may have to make some unthinkable alliances. To represent the war, the cards of the set are mostly divided into two groups: The physical beings with their regular magic, and the Kami spirits with their \"arcane\" magic.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "BOK",
            "story": "Now in the employ of Princess Michiko and beholden to the Myojin of Night's Reach, Toshi Umezawa tries to honor his commitments while pursuing his own ends. But as the Kami War threatens to engulf Kamigawa, an unimaginably powerful spirit beast threatens the world. And at the heart of the battle moves the figure of the Daimyo, whose impassive features conceal a sinister crime that gnaws at the world's heart.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "SOK",
            "story": "The ronin Toshi has sought to avoid the great conflict between the spirit and human realms. But despite his best efforts, he's not only involved in it, he's at the center of it. Together with Princess Michiko, daughter of Daimyo Konda, he must find a way to stave off the impending victory of the kami, while preserving his own life into the bargain. ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "RAV",
            "story": "Following in the tradition of recent previous Magic blocks, Ravnica takes place in a plane of the multiverse that was previously unexplored in the game's backstory. The world of Ravnica is an ecumenopolis, a vast city that covers the entire surface of its planet, and is home to a diverse assortment of sentient races. For ten thousand years, there has been a power struggle between the ten Ravnican guilds, political factions that each represent a combination of two of Magic's five colors. Ten millennia ago, the Guildpact was signed by the paruns, ending active warfare between them and ushering in an era of peace. But now, on the eve of the celebrations of the accord's ten thousandth anniversary, a sinister force threatens the survival of that peace.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "GPT",
            "story": "The Guildpact has kept Ravnica stable for thousands of years. But with ten guilds vying to become the dominant force on the planet, there's always a chance that things will break down. Guildpact continues the story of this massive city, and introduces players to three more guilds. The Gruul ravages the streets. Teysa leads the Orzhov Syndicate to \"cleanse\" them. And Agrus Kos doesn't give a damn.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "DIS",
            "story": "The streets of Ravnica run red with blood. Guild fights guild and horrifying monsters ravage the city, destroying all who stand in their way. But as Ravnica crumbles, a method emerges from the madness, and it becomes clear that the city's chaos was calculated. Something must be done. And unfortunately for Kos, being dead doesn't mean you don't have a job to do. The Guildpact's spell is finally broken when he publicly arrests Szadek, exposing him and House Dimir to the public.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "CSP",
            "story": "Terisiare, the island continent that was home to the Brothers’ War and the Ice Age, is in a state of rebirth known as the Thaw. The icy shell that encased the continent is melting away. Most of the inhabitants of Terisiare rejoice as the ice gives way to warmth and the rebirth of the land. But, in this time of great change, there are some who see it as a time to angle for power: a secretive society of mages poised to shroud the continent with their icy brand of magic.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "TSP",
            "story": "After more than its fair share of cataclysms, the plane Dominaria is in ruins. Over two hundred years ago, Phyrexia invaded the plane. In the end Phyrexia and its god, Yawgmoth, were defeated, but not before they devastated Dominaria. Salt rains from the sky and the air is poisonous. The trees are gray and rotting and covered with a sickly, fungal kudzu. The elves must subsist on mossy scraps. Their greenseekers roam Dominaria in search of any thriving plant matter, but the plains are dry salt flats blasted by windstorms. Nothing grows there. The swamps are littered with the dripping carcasses of Phyrexian horrors. Mountains are eroded down to obelisk-like spires while seas' acidic waters eat away at the solidified volcanic spurts that dot the waves. Time also seems to be in trouble, as people, locations and objects from the plane's past seem to appear and disappear on their own.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "PLC",
            "story": "Dominaria’s temporal fabric is no longer fraying at the edges — it’s ripping down the middle. The time rifts have not only merged the past with the present, but also splintered the timeline into thousands of alternate histories. These divergent Dominarias overlap with the known world in bizarre ways, combining the familiar with the shockingly new. Teferi, having lost his Planeswalker's spark, still struggles to mend the planar rifts before they corrode the very structure of the multiverse. With his allies Jhoira and Venser, he has already succeeded in restoring the wayward region of Shiv to its natural place in Dominaria, healing one rift. But danger awaits them as the trio attempts to teleport to Urborg: the chaos of an alternate Dominaria…",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "FUT",
            "story": "The quest to mend Dominaria’s temporal and planar damage continues. A temporal rift connected to an alternate Dominaria has enabled Phyrexian horrors to cross over into the present day. Freyalise is gone, having given her planeswalker's spark and her life to close that rift, thereby protecting her sanctum of Skyshroud one last time. But time fractures still plague Dominaria. The damage to the planar fabric at Tolaria was so severe that it couldn't be healed — not in the present day. The heroes seek out the planeswalker Karn, the only being ever to travel through time. To heal Tolaria’s rift, Karn uses the full extent of his planeswalking power to enter the rift and return to the past, to the moment before the archwizard Barrin cast a spell that obliterated countless Phyrexians and himself. Karn succeeds and seals the planar rift before Barrin’s actions can rip it open. In the next moment, Karn is lost.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "LRW",
            "story": "Lorwyn is an idyllic world where nature thrives in its most pristine state. The sun never drops below the horizon, and midsummer never ends. The creatures of fable who dwell there know nothing of gloom or malice — but they are consumed with rivalry. For inspiration, the creative team turned to Celtic folklore and mythology. There are influences from Irish, English, Welsh, Scottish, and Celtic stories, languages and cultures in both the look and world details of the setting.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "MOR",
            "story": "The set continues the \"celtic fairytale\" setting of Lorwyn. Rhys, once a prominent hunter among the elves, has two big problems. He's being blamed for a cataclysmic event that killed many of his fellows. Even worse, his horns are broken, which makes him ugly. This makes him doubly damned in the eyes of his society. Knowing his skill and reputation, they are pulling out all the stops to bring him to their vicious brand of justice. As if he didn't have enough to worry about with his own skin, he has to deal with the Aurora.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "SHM",
            "story": "Shadowmoor was once the world of Lorwyn — in fact, in a sense, it still is. But thanks to the Great Aurora, everything's changed. Where it was once constantly sunny, now it is always night, steeped in gloom and fog, with only cold moonlight to light the skies. Once-clear waters have turned brackish and chill. The howling wind creaks the brittle branches of rotting trees. Life, once abundant, either struggles to survive or is twisted into something vicious and cruel. This is not a world of despair, but of oppressive terror and constant death.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "EVE",
            "story": "As the gloom deepens over the world of Shadowmoor, the plane's eerie transformation is complete. Selkies, duergar, hobgoblins, and other creatures from the macabre fringes of folklore thrive in the permanent night. Their mix of mischief and malice drives the wholesome elves and the xenophobic kithkin back into their strongholds, opening the door for sinister forces to reign.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "ALA",
            "story": "Alara was a single plane once, a massive world rich with mana. However, those same resources led to its downfall, for an unknown planeswalker tore the plane asunder millennia ago, harvesting it of its mana. This disaster broke Alara along color lines into incomplete planes called shards, as light is diffracted by a prism. The shards recovered their mana in time, but only in part. Each shard is vastly different, as the combinations of triple-colored mana have shaped natural and cultural forces on each world in distinctive ways.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "CON",
            "story": "A powerful and infinitely sinister force is conspiring to reunite the Shards of Alara. This reunification will come with a deadly price – sheer chaos, as realities begin to overlap. Thus begins the Conflux.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "ARB",
            "story": "The violent plans orchestrated by Nicol Bolas have reached their cataclysmic zenith, as the five shards of Alara are now merged, with untold power and unspeakable chaos at every turn. In this unpredictable environment, where mythic beings can greatly affect the outcome, mere survival isn’t enough. To live another day, one must battle with unflinching intensity to rise above the madness and master this now grotesquely unified plane. Amidst this overwhelming carnage, can Alara truly said to be reborn?",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "ZEN",
            "story": "Zendikar is based on the plane of the same name which had not been featured previously in Magic, but had been alluded to within the planeswalker novel of The Purifying Fire. It is a plane of adventure, many treasures, and potent mana supplies, but mana on this plane works differently than in the rest of the multiverse. The plane is littered with large, floating polyhedron-shaped stones called Hedrons, prominently featured in the artwork. Little is known of these Hedrons as not even the people native to the plane know about their purpose. The floating stones however are also an indicator of the fact that gravity is different on Zendikar than on other planes. Zendikar is populated by Goblins, Elves and Vampires among others. Zendikar is also the home plane of the Kor and as such they are predominately featured as the race for white in the set. It is revealed that their appearance on Rath and other planes is due to abductions from Zendikar.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "WWK",
            "story": "Ancient forces begin to awaken, causing the world of Zendikar to wreak havoc upon its inhabitants. This exotic and dangerous world is made even more perilous and yet more attractive to adventurers and Planeswalkers wishing to plunder its treasures.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "ROE",
            "story": "For thousands of years, Zendikar has had a reputation as a deathtrap. It's been a world of deadly perils to planeswalkers and native explorers, punishing any who seek to loot its hidden treasures and exploit its potent mana. But unknown to the plane's denizens, there's a sinister reason for Zendikar's danger: for millennia, the plane has served as a prison for the Eldrazi, astral monstrosities native to the Blind Eternities, the space between planes. Now, the perils facing adventurers on the plane of Zendikar have taken an even deadlier turn. The Eldrazi have been released. The Eldrazi have transcended the colors of mana as we know them. As a result, the Eldrazi progenitors themselves and those closest to them are colorless. But don't let the mana cost fool you—these Eldrazi are not artifacts. Each of the colossal Eldrazi spawns its own \"brood lineage.\" The three brood lineages are composed of Eldrazi Drones and other subordinate beings, each reflecting the image of its progenitor.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "SOM",
            "story": "The metal plane of Mirrodin shines under the light of five suns ... but it’s now tarnished by the deadly scourge known as Phyrexia. Besides the Mirran-Phyrexian conflict, the story also revolves around several planeswalkers. Elspeth Tirel (as a new card of the same name, Elspeth Tirel) returns while a new planeswalker by the name of Koth is introduced who appears to be of Vulshok heritage and thus would be native to Mirrodin. His card is called Koth of the Hammer, making his name an acronym of the name of the card. Venser and Tezzeret are also involved in the storyline, the former confirmed to getting a new card, Venser, the Sojourner. Being set on Mirrodin, the expansion features themes and settings already known from that plane. For example, creature types and tribes of these such as Leonin (Cats), Vampires, Loxodon (Elephants), Elves, or the Human tribes of Vulshok, Sylvok, Auriok, Moriok and Neurok. Artifact creatures such as Golems and Myr also return.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "MBS",
            "story": "The Phyrexian assault on the metallic plane of Mirrodin intensifies. The Mirran resistance rallies to survive and overcome. Both sides bring the full might of their arsenals to bear. The silver golem Karn has retreated to Mirrodin's Core, being worshipped as the new Father of Machines. When Phyrexia grows upon Mirrodin, Karn is trapped in his own mind, battling between himself and the role the Phyrexians are trying to force upon him.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "NPH",
            "story": "It came not in the form of a noble struggle, a fair contest of warriors clashing will against will, but as a wave of unstoppable slaughter. Mirran partisans resisted bravely, using their wits and magic to fend off the onslaught that originated from inside their own world. But their efforts were for naught. Phyrexia is victorious. Mirrodin now goes by a different name: New Phyrexia.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "ISD",
            "story": "Innistrad is a plane of menace and dread where every creature hides a darker aspect. Here, hedonistic vampires stalk the shadows to quench their thirst, and the full moon can transform a simple villager into a savage werewolf. ",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "DKA",
            "story": "Innistrad has been overrun by creatures of the night. While the forces of good struggle to hold back the threat, villagers cower behind walls and pray for the morning light. The humans are on the verge of extinction and have to take desperate measures to stem the tide. It is revealed that Avacyn, the guardian angel created by Sorin is locked in the Helvault.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "AVR",
            "story": "Avacyn, the angelic protector of the plane of Innistrad has been released from her prisoning, the Helvault. The demon Griselbrand, and numerous of his kind, have been released as well. Avacyn Restored plays out Avacyn's campaign to rally her troops to contain the demonic threat and, ultimately, to cleanse Innistrad of all these infernal creatures.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "RTR",
            "story": "As the name of the expansion implies, Return to Ravnica is set in Ravnica, a plane comprising a singular megalopolis or ecumenopolis, in which a vast and diverse variety of inhabitants co-exist. Once, the law of city and plane of Ravnica was dictated by the Guildpact and was controlled in relative harmony by the ten guilds, each of which representing a color pairing of the five colors of Magic. In Dissension, however, the Guildpact had been broken. Faced with a magical code that is built into the very foundations of the city-world itself, Jace Beleren marches into the numinous depths of Ravnica’s underbelly in search of the promise of powerful magic. Once buried in past, the code resurfaces as Ravnica’s power-hungry mage guilds, unbound by the Guildpact that had once maintained order, struggle for control of the plane.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "GTC",
            "story": "Jace begins to piece together the greater mystery of the Implicit Maze. It's now a race to see who will unlock its secrets.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "DGM",
            "story": "The Implicit Maze is a system of mana paths or leylines through the guildgates and districts of Ravnica that has manifested after the Guildpact was destroyed. On instruction of Niv-Mizzet and using Jace Beleren's notes, it was discovered by Ral Zarek. The maze was created by Azor I to be revealed in case the Guildpact dissolved. In this way, the founder of the Azorius Senate tried to foster an atmosphere of peaceful collaboration. At the end of the maze in the Forum of Azor lies great power. In order for it to be solved, all the guilds of Ravnica must participate at once. Niv-Mizzet has announced that each guild will send one champion as its delegate in the running of the maze. At an appointed time, the champions meet at the Transguild Promenade, and embark on a race through the twists and turns of the maze. The one who triumphs, gains the power behind it for his or her guild. Others fall to its dangers.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "THS",
            "story": "Theros is watched over by a pantheon of 15 powerful gods. The gods, though residing in Nyx, are able to take on many forms and often walk among mortals. Each also has a unique color identity. The five core gods are mono-colored and make up the central pillars of the Therosian belief system. The color identities of these five are: Heliod (white), Thassa (blue), Erebos (black), Purphoros (red), and Nylea (green). The ten minor gods represent the two-colour pairings and were introduced later in Born of the Gods and Journey into Nyx.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "BNG",
            "story": "No longer content to walk the planes of the Multiverse seeking pleasure, the planeswalker Xenagos returns to Theros to become the god of revels. The boundaries that separate everyday existence from Nyx are growing dangerously thin. Strange creatures of enchantment, called Nyxborn or Born of the Gods, are pouring into the mortal world as Xenagos threatens to disrupt the very nature of the plane. Mogis, the god of slaughter sends hordes of mortal and Nyxborn minotaurs against the human cities Akros, Meletis and Setessa. Elspeth Tirel leads an army of heroes to break the minotaur siege at Akros. The humans were victorious, but the victory celebration after the battle becomes the ultimate ritual to launch Xenagos into Nyx as a god. Elspeth is blamed for his ascension and driven away in disgrace.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "JOU",
            "story": "The plane of Theros is in chaos. Gods and mortals are pitted against each other, and terrifying monsters stalk the land. Heroes strive for glory while new and terrifying constellations take shape in the night sky. Supported by Ajani, Elspeth travels to Nyx and kills Xenagos. Afraid of her power, Heliod kills Elspeth.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "KTK",
            "story": "Tarkir is a world embattled with ambitious warlords and powerful clans that wage eternal war for supremacy of their plane, a conflict that spans over a thousand years. Tarkir is also the home plane of Sarkhan Vol. It was previously inhabited by dragons, all of whom were killed before Sarkhan's period of servitude. The clans each worship one aspect of the extinct dragons.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "FRF",
            "story": "Sarkhan Vol travels 1,280 years back in time, to change the moment that sealed Tarkir's fate: the battle between Nicol Bolas and Ugin, the demise of the latter and all dragons of Tarkir (Crux of Fate). The clans still exist back in the time; they are not fighting each other but are constantly fending off the legion hordes of dragons that are terrorizing their world. Sarkhan meets khans of the past, like Yasova Dragonclaw. The history of Tarkir is rewritten.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "DTK",
            "story": "After Sarkhan Vol has done his duty in the past, the story now returns to the present of Tarkir. But it seems that changing the past has produced some unexpected results. Mighty Dragons now rule the skies and the five clans that comprise most of Tarkir's populace. Known characters have an altered fate; Zurgo is just a puny orc and Narset has not died at all, but became a planeswalker instead.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "BFZ",
            "story": "Battle for Zendikar returns the storyline to Zendikar, a plane of adventure, many treasures, and potent mana supplies. The plane is littered with large, floating polyhedron-shaped stones called Hedrons, that were created by Nahiri, the Kor Lithomancer. Together with Ugin and Sorin Markov she used them to trap the horrendous Eldrazi on the plane. Thousands of years later, the meeting of Sarkhan Vol, Chandra Nalaar and Jace Beleren in the Eye of Ugin chamber unintentionally loosened the bonds that kept the Eldrazi in torpor. The Eldrazi were finally released by the elf Nissa Revane, thinking that they would leave Zendikar far behind them. She was wrong. Two years after the initial destruction, at least Ulamog is still around. Now, Gideon Jura takes the lead of a group of planeswalkers in facing the Eldrazi alongside the residents of Zendikar. Meanwhile, the trapped planeswalker-turned-demon Ob Nixilis is desperate for a way off of the plane.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "OGW",
            "story": "Four planeswalkers (Gideon Jura, Jace Beleren, Chandra Nalaar and Nissa Revane) join forces in their battle against the Eldrazi titans Ulamog and Kozilek and the demonic planeswalker Ob Nixilis. They become the Gatewatch, a team with a lasting commitment to protect the people of the Multiverse from threats that no one else can handle. The six cards that represent the pivotal moments in the storyline are: Kozilek's Return, Remorseless Punishment, Call the Gatewatch, Bonds of Mortality, Fall of the Titans and Zendikar Resurgent.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "SOI",
            "story": "Innistrad is a world beset by terrible evils on all sides and betrayed by the hope it held most dear. Avacyn has finally returned, but what new evils have come with her? Madness is plaguing the inhabitants. Terror falls from the skies on blood-spattered wings and nameless horrors lurk in the shadows. Odd things are afoot: the forces that had protected the humans have been twisted into something dark and strange. Jace Beleren of the Gatewatch investigates its dark mysteries. Meanwhile, Sorin is in search of the whereabouts of Nahiri.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "EMN",
            "story": "With the death of Avacyn, the last protections over Innistrad have faded. Nahiri has summoned Emrakul to the plane, to take revenge on Sorin Markov. The Titan of Corruption and Warper of Biology twists all things living, be it plants, animals, or sentient beings, into Eldrazi Horrors. Mutations frequently gain Emrakul's fibrous lattice motif, often including tentacles, extra eyes and limbs and her bizarre colorations. The mutations include five increasing levels of corruption: distorted, disfigured, deformed, misshapen and monstrous. Some of the affected creatures meld together into new organisms. The few unaffected survivors, humans and native monsters alike, fight a losing battle against their mentally and physically twisted former peers. Now Innistrad's fate rests in the hands of unlikely allies: Jace Beleren brings the Gatewatch, and Liliana Vess brings hordes of undead immune to Emrakul's influence.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "KLD",
            "story": "Kaladesh (first glimpsed in Magic Origins as the birthplane of Chandra Nalaar) is a plane where natural mages are rare. Work that would be done with magic on other planes is instead accomplished through devices. The automatons, thopters, and other artifact creatures of the plane are fueled by aether, which is heavily trafficked. Artifacts are built as much for beauty as for function. Fire magic is strictly banned, and pyromancy punishable with a death sentence. Chandra returns to Kaladesh and saves her mother from her nemesis Baral. The Gatewatch unexpectedly is confronted by the scheming Tezzeret. Kaladesh is ruled by the Consulate. Their forces and works are nearly omnipresent.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "AER",
            "story": "A revolt takes place on Kaladesh. Led by Pia Nalaar and aligned with aether-pirates, essence-drainers and weaponsmiths, the Renegades have seized control of large portions of Ghirapur. They seek to overthrow the authority of the Consulate. The Consulate responds with increased security and surveillance, the seizure of unregistered inventions, the monitoring of aether distribution, and the enforcement of a city-wide curfew. The Gatewatch and Ajani Goldmane support the renegades, while searching for the nefarious planeswalker Tezzeret.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "AKH",
            "story": "Amonkhet is a plane ruled by Nicol Bolas. The desert oasis forges warriors. They train their entire life for a chance to face the Trials of the Five Gods and join the elite ranks of the Worthy and to claim an honored place in the Afterlife. They prepare for the great God-Pharaoh's return. When The Gatewatch arrives to take out Bolas, they meet with fierce resistance in the desert, and in the city a society centered around death.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "HOU",
            "story": "As promised, the God-Pharaoh has returned. Unfortunately, the promise of a glorious afterlife wasn't quite what everyone thought it was. Nicol Bolas has come to claim his perfect Zombie army, the Eternals. The Gatewatch is easily defeated. Samut's planeswalker's spark is ignited.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "XLN",
            "story": "This is a story about desire. It is desire for power, desire for companionship, desire for approval, desire for discovery, and everyone is racing to get what they want first. For centuries, the untamed jungles of Ixalan have hidden a coveted secret: Orazca, the city of gold, which houses a mysterious artifact, the Immortal Sun. But no secret can remain undiscovered, and no treasure can be taken uncontested. The dinosaur riding warriors of the Sun Empire and the merfolk shamans of the rival River Heralds are met by the vampire conquistadores of the Legion of Dusk and the pirates of the Brazen Coalition. Vraska poses as a pirate on the high seas, while Jace Beleren is stranded on the plane with loss of all his memories.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "RIX",
            "story": "The legendary city of Orazca has been found, but it is not claimed without a fight. The winner will wield the greatest power of the plane. An unexpected rival takes the prize for his master. The cards that represent the Story Spotlights in Ixalan are: Flood of Recollection, Induced Amnesia, and Mastermind's Acquisition. This is the first set to only have three spotlight cards. These feature a Planeswalker symbol icon as a watermark in their text boxes. The icon has no effect on game play.",
            "symbol": "https://www.google.com/"
        },
        {
            "id": "DOM",
            "story": "Dominaria is set on the plane of the same name, for the first time since the Time Spiral block (or Magic Origins if sets involving multiple planes are included). Sixty years after the Mending, this world is healing from its wounds. Returning legendary characters are Teferi, Jhoira, Jaya Ballard, and Karn. Dominaria’s story starts right after the events of Hour of Devastation. Gideon and Liliana have arrived on Dominaria following the Gatewatch’s defeat at the hands of Nicol Bolas. Together, they begin a mission to kill Belzenlok, the final demon holding Liliana’s contract.",
            "symbol": "https://www.google.com/"
        }
    ]
    
}